 /**
  ******************************************************************************
  * @file    myiic.c
  * @author  Jerry
  * @date    17-Dec-2018
  *
  * @brief   声音芯片驱动文件
  *		包括声音芯片PT2259，以及功放NS4160
  *	
  ******************************************************************************
  */
#include "include.h" 

/***********************************************************************************
 * 函数名:	Speaker_Init 
 * 描述: 
 *           	-声音电路部分初始化
 *
 * 输入参数: 
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void Speaker_Init(void)
{
	// PT2259初始化
	IIC_Init();
	// NS4160初始化
	NS4160_GPIO_OUT_Config();

	Delay_Ms(10);
	/* 打开PT2259, 并禁止静音*/
	PT2259_Config(CHIP_CLEAR);
 	PT2259_Config(MUTE_OFF);
	// 增益-42DB
	PT2259_Set(NEG_10DB|0x00,NEG_1DB|0x02);
}

/***********************************************************************************
 * 函数名:	Speaker_Test 
 * 描述: 
 *           	-开机的时候测试下声音
 *
 * 输入参数: 
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void Speaker_Test(void)
{
	// 用内置的语音样本测试PCA
	PCA_Test_SampleVox();   DEBUG_PUTS_("Beep....\n");
	PCA_Test_SampleVox();   DEBUG_PUTS_("Beep....\n");
	PCA_Test_SampleVox();   DEBUG_PUTS_("Beep....\n");

	Vox_PlayList_Add( ID_NiHao );
	Vox_Wait_AllPlayDone();
}

/***********************************************************************************
 * 函数名:	PT2259_WriteOneByte 
 * 描述: 
 *           	-向PT2259写入一个数据
 *
 * 输入参数: DataToWrite:要写入的数据
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void PT2259_WriteOneByte(u8 DataToWrite)
{	
	volatile uint8_t ucAck;

	IIC_Send_Byte(DataToWrite);     //发送字节							   
	ucAck = IIC_Wait_Ack();  		    	   	 
}

/***********************************************************************************
 * 函数名:	PT2259_Write 
 * 描述: 
 *           	-向PT2259写入多个字节
 *
 * 输入参数: WriteAddr :要写入的地址,固定.pBuffer   :数据数组首地址
 *		NumToWrite:要写入数据的个数
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void PT2259_Write(u16 WriteAddr,u8 *pBuffer,u16 NumToWrite)
{
	while(NumToWrite--)
	{
		PT2259_WriteOneByte(*pBuffer);
		pBuffer++;
	}
}

/***********************************************************************************
 * 函数名:	PT2259_Set 
 * 描述: 
 *           	-设置音量,即设置衰减量,见手册P9,需要连续写入2个字节:
 *		比如衰减-42dB,需要先衰减-40dB，然后衰减-2dB.
 *		也可以先设置-2,然后-40
 *
 * 输入参数: ucData10DB :-10DB基数
 *		ucData1DB:-1DB基数
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void PT2259_Set( u8 ucData10DB,u8 ucData1DB )
{
	IIC_Start();
	PT2259_WriteOneByte( PT2259_ID );
	PT2259_WriteOneByte( ucData10DB );
	PT2259_WriteOneByte( ucData1DB  );
	IIC_Stop();
}

/***********************************************************************************
 * 函数名:	PT2259_Config 
 * 描述: 
 *           	-PT2259配置,关闭或者开启静音,复位等等
 *
 * 输入参数: Data :要设置的模式
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void PT2259_Config(u8 Data)
{
	IIC_Start();
	PT2259_WriteOneByte( PT2259_ID);  // is PT2259 address
	PT2259_WriteOneByte( Data ); // clear register
	IIC_Stop();
}

/***********************************************************************************
 * 函数名:	PT2259_Clear 
 * 描述: 
 *           	-PT2259复位,已经用
 *
 * 输入参数: Data :要设置的模式，PT2259_Config替代
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void PT2259_Clear()
{
	IIC_Start();
	PT2259_WriteOneByte( PT2259_ID);  // is PT2259 address
	PT2259_WriteOneByte( 0xf0 ); // clear register
	IIC_Stop();
}

/***********************************************************************************
 * 函数名:	PT2259_OpenVolume 
 * 描述: 
 *           	-静音开启/关闭
 *
 * 输入参数: Data :要设置的模式，PT2259_Config替代
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void PT2259_OpenVolume(u8 Data)
{
	IIC_Start();
	PT2259_WriteOneByte( PT2259_ID);  // is PT2259 address
	PT2259_WriteOneByte( Data ); // clear register
	IIC_Stop();
}


/***********************************************************************************
 * 
 * NS4160设置部分
 *
 ***********************************************************************************/

/***********************************************************************************
 * 函数名:	NS4160_Output_High 
 * 描述: 
 *           	-向NS4160输出引脚为高
 *
 * 输入参数: 
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void NS4160_Output_High(void)	
{
	GPIO_SetBits(NS4160_OUT_GRP, NS4160_POUT);
}

/***********************************************************************************
 * 函数名:	NS4160_Output_Low 
 * 描述: 
 *           	-向NS4160输出引脚为低
 *
 * 输入参数: 
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void NS4160_Output_Low(void)	
{
	GPIO_ResetBits(NS4160_OUT_GRP, NS4160_POUT);
}

/***********************************************************************************
 * 函数名:	NS4160_AB_type 
 * 描述: 
 *           	-设置NS4160为AB类
 *
 * 输入参数: 
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void NS4160_AB_type(void)	
{
	NS4160_Output_Low();
	Delay_Us(30);
	NS4160_Output_High();
	Delay_Ms(50);
}

/***********************************************************************************
 * 函数名:	NS4160_D_type 
 * 描述: 
 *           	-设置NS4160为D类
 *
 * 输入参数: 
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void NS4160_D_type(void)	
{
	NS4160_Output_Low();
	Delay_Xus(200);
	NS4160_Output_High();
	DELAY_4uS();
	NS4160_Output_Low();
	DELAY_4uS();
	NS4160_Output_High();
	Delay_Ms(80);
}

/***********************************************************************************
 * 函数名:	NS4160_Disable 
 * 描述: 
 *           	-关闭NS4160,休眠
 *
 * 输入参数: 
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20190111
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void NS4160_Disable(void)	
{
	GPIO_ResetBits(NS4160_OUT_GRP, NS4160_POUT);
	Delay_Xus(200);
}

/***********************************************************************************
 * 函数名:	 
 * 描述: 
 *           	-配置指定输出外设.
 *		
 * 输入参数: 
 * 输出参数: 
 * 返回值: 
 * 
 * 作者:Jerry
 * 创建日期:20181109
 * 
 *------------------------
 * 修改人:
 * 修改日期:
 *
 *
 ***********************************************************************************/
void NS4160_GPIO_OUT_Config(void)	
{
	GPIO_InitTypeDef GPIO_InitStructure;

	/*开启输出按键端口PX的时钟*/
	RCC_Clock_Set(NS4160_OUT_GRP, ENABLE);
	//RCC_APB2PeriphClockCmd( DEVICE_RCC_GRP, ENABLE); // 使能PC端口时钟  
	GPIO_InitStructure.GPIO_Pin = NS4160_POUT;	//选择对应的引脚
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;       
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(NS4160_OUT_GRP, &GPIO_InitStructure);  //初始化端口
	NS4160_Output_Low();
}

